Examinator/src/Catalogs/ВопросыСУЗ/ВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Имя макета, которое задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементActiveX</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ОтображениеВариантовВопросаСУЗ/ОтображениеВариантовВопросаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтображениеВариантовВопросаСУЗ</name>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>Номер</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыВопросовСУЗ/ТипыВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВопросовСУЗ</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихПсихологический</name>
  </enumValues>
  <enumValues>
    <name>МногиеИзМногихПсихологический</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ПопыткаВыполненияПодборкиВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияПодборкиВопросовСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>DefinedType.ВариантЗаданияЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подборка</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполненияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <comment>Отведенное на выполнение время теста</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБалловПсихологическихВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическийВопрос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесВопроса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементПодборкиИзРубрикатора</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиИзРубрикатораСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПодборки</name>
    <comment>Сохраняются группы подборки (элементы подборки верхнего уровня, которые образует ее страницы), которые были на момент начала сессии теста. В ссылках параметр numGroup</comment>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеВопросыОтвечены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВопросыНаПроверку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ВариантыОтветовНаВопросСУЗ/ВариантыОтветовНаВопросСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовНаВопросСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВернаяГруппаФасетов</name>
    <type>
      <types>CatalogRef.ФасетыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Верный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоступныхВариантов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредлагатьВыборВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсДляВерногоКомментария</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсДляОшибочногоКомментария</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>БаллПриПсихологическомТестировании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыОбъектовСУЗ/РесурсыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ВопросыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.question;
	
КонецФункции

// Позволяет получить XML данные объекта Вопрос.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Вопрос, ПараметрыСсылки, КонтекстВыполнения) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		ТекущаяДата = ТекущаяДата();
		
		ПоставщикСводаЗнаний     = Справочники.СводыЗнанийСУЗ.Поставщик(КонтекстВыполнения.ЭлектронныйРесурс);
		ИдентификаторСводаЗнаний = Справочники.СводыЗнанийСУЗ.ИдентификаторКаталога(КонтекстВыполнения.ЭлементСодержания);
		ИдентификаторВопроса     = Вопрос.УникальныйИдентификатор();;
		
		ИмяОбъектаСУЗ  = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
		ИмяТипаВопроса = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Вопрос.ТипВопроса);
		
		ВопросXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question","Вопрос"); 
		ВопросXDTO     = ФабрикаXDTO.Создать(ВопросXDTOТип);
		
		ВопросXDTO.id                                = ИдентификаторВопроса;
		ВопросXDTO.object                            = ИмяОбъектаСУЗ;
		ВопросXDTO.Наименование                      = Вопрос.Наименование;
		ВопросXDTO.ТипВопроса                        = ИмяТипаВопроса;
		ВопросXDTO.ФасетныйВопрос                    = Вопрос.ФасетныйВопрос;
		ВопросXDTO.ОтображатьИменаПолей              = Вопрос.ОтображатьИменаПолей;
		ВопросXDTO.ОтображатьНаименование            = Вопрос.ОтображатьНаименование;
		ВопросXDTO.ГоризонтальноеРазмещениеВариантов = Вопрос.ГоризонтальноеРазмещениеВариантов;
		ВопросXDTO.ПоследовательныйВыводВариантов    = Вопрос.ПоследовательныйВыводВариантов;
		ВопросXDTO.РежимЭкспорта                     = ?(КонтекстВыполнения.ПараметрыЭкспорта = Неопределено, Ложь, Истина);
		ВопросXDTO.СкрытьКомментарии                 = false;
		
		Если НЕ ПустаяСтрока(Вопрос.ПредставлениеГрупп) Тогда
			ВопросXDTO.ПредставлениеГрупп = Вопрос.ПредставлениеГрупп;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Вопрос.ПредставлениеКатегорий) Тогда
			ВопросXDTO.ПредставлениеКатегорий = Вопрос.ПредставлениеКатегорий;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Вопрос.ПредставлениеВариантовОтветов) Тогда
			ВопросXDTO.ПредставлениеВариантовОтветов = Вопрос.ПредставлениеВариантовОтветов;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Вопрос.ОтображениеВариантов) Тогда
			ВопросXDTO.ОтображениеВариантов = Вопрос.ОтображениеВариантов;
		Иначе
			ВопросXDTO.ОтображениеВариантов = Перечисления.ОтображениеВариантовВопросаСУЗ.Текст;	
		КонецЕсли;
		
		ВопросXDTO.ПрикреплятьКомментарииКВариантамОтвета = Вопрос.ПрикреплятьКомментарииКВариантамОтвета;
		
		// 1. Если подборка в режиме теста, то получаем документ сессии "ПопыткаВыполненияПодборкиВопросовСУЗ".
		
		НомерДокумента = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "numDocument");
		НомерСтраницы  = Справочники.ПодборкиСУЗ.НомерСтраницы(ПараметрыСсылки);
		
		Попытка
			НомерДокумента = Число(НомерДокумента);
		Исключение КонецПопытки;
		
		СессияXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Сессия"); 
		СессияXDTO     = ФабрикаXDTO.Создать(СессияXDTOТип);
		
		Если ТипЗнч(НомерДокумента) = Тип("Число") И ТипЗнч(НомерСтраницы) = Тип("Число") Тогда 
			
			ДокументСессии = ОбъектыСУЗ.ДокументСессииТестирования(НомерДокумента, КонтекстВыполнения, Ложь);
			
			СессияXDTO.numDocument = Формат(НомерДокумента, "ЧГ=0");
			СессияXDTO.numGroup    = Формат(НомерСтраницы, "ЧГ=0");
			
		Иначе
			
			ДокументСессии = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ПустаяСсылка();
			
		КонецЕсли;
		
		// 2. Получаем документ ответа на вопрос "ОтветНаВопросСУЗ". Существует всегда.
		
		// Примечание: можно ответить на вопрос даже если сессия не открыта,
		// То есть ДокументСессии = Пустая ссылка.
		
		ПервоеОтображениеВопроса = Истина;
		
		Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
			
			Запрос = Новый Запрос();
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	ОтветНаВопросСУЗ.Ссылка
			|ИЗ
			|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
			|ГДЕ
			|	ОтветНаВопросСУЗ.Вопрос = &Вопрос
			|	И ОтветНаВопросСУЗ.СессияВыполненияТеста = &ДокументСессии
			|	И ОтветНаВопросСУЗ.Проведен = ИСТИНА
			|    И ОтветНаВопросСУЗ.Отменено = ЛОЖЬ
			|";
			
			// Примечание: если нет документа сессии, то ищем документ ответа на вопрос
			// Для текущего пользователя и с пустым документом сессии.
			Если НЕ ДокументСессииЗаполнен(ДокументСессии) Тогда
				ТекстЗапроса = ТекстЗапроса + " И ОтветНаВопросСУЗ.Пользователь = &Пользователь";
				Запрос.УстановитьПараметр("Пользователь", ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения));
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("Вопрос", Вопрос); 
			Запрос.УстановитьПараметр("ДокументСессии", ДокументСессии); 
			
			Результат = Запрос.Выполнить().Выбрать();
			
			ПервоеОтображениеВопроса = ?(Результат.Количество() = 0, Истина, Ложь);
			
		КонецЕсли;
		
		Если ПервоеОтображениеВопроса Тогда // Первый раз отображается вопрос.
			
			Если НЕ ДокументСессииЗаполнен(ДокументСессии)
				ИЛИ (ДокументСессииЗаполнен(ДокументСессии)
				И ДокументСессии.Пользователь = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения)
				И НЕ ДокументСессии.ТестЗавершен) Тогда
				
				// Создаем новый документ ответа на вопрос.
				
				ДокументОтветаНаВопрос = Документы.ОтветНаВопросСУЗ.СоздатьДокумент();
				ДокументОтветаНаВопрос.Дата                     = ТекущаяДата;
				ДокументОтветаНаВопрос.СессияВыполненияТеста    = ДокументСессии;
				ДокументОтветаНаВопрос.Вопрос                   = Вопрос;
				ДокументОтветаНаВопрос.Пользователь             = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
				ДокументОтветаНаВопрос.ДатаПервогоПоказаВопроса = ТекущаяДата;
				
			КонецЕсли;
			
		Иначе
			
			Результат.Следующий();
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ОтветНаВопросСУЗ");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Результат.Ссылка);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			ДокументОтветаНаВопрос = Результат.Ссылка.ПолучитьОбъект();
			
		КонецЕсли;
		
		Если ДокументОтветаНаВопрос <> Неопределено Тогда // Иначе - это пропущенный вопрос
			
			Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
				
				Подборка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОтветаНаВопрос.СессияВыполненияТеста, "Подборка");
				
			Иначе
				
				Если КонтекстВыполнения.ПараметрыЭкспорта.Свойство("ДокументСессииОбъект")
					И КонтекстВыполнения.ПараметрыЭкспорта.ДокументСессииОбъект <> Неопределено Тогда
					
					Подборка = КонтекстВыполнения.ПараметрыЭкспорта.ДокументСессииОбъект.Подборка;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Подборка) Тогда
				ДанныеПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подборка, "ПоказыватьСтоимостьВопроса, ИсключитьОткрытыеВопросы, СкрытьКомментарииВопросов, НазначениеТестирования");
			Иначе
				ДанныеПодборки = Неопределено;
			КонецЕсли;
			
			ВопросXDTO.РазрешенРазвернутыйОтвет = РазрешенРазвернутыйОтветНаВопрос(Вопрос, ДанныеПодборки);
			
			Если ЗначениеЗаполнено(Подборка) 
				И ДанныеПодборки.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Анкетирование Тогда
				ВопросXDTO.СкрытьРезультат = Истина;
			Иначе
				ВопросXDTO.СкрытьРезультат = Ложь;
			КонецЕсли;		
			
			Если ДанныеПодборки <> Неопределено Тогда
				ВопросXDTO.СкрытьКомментарии = ДанныеПодборки.СкрытьКомментарииВопросов;
			КонецЕсли;
			
			Если ДокументОтветаНаВопрос.ВариантыОтветов.Количество() = 0 Тогда
				// Документ ОтветНаВопросСУЗ был очищен и надо сформировать его заново.
				// Но при этом новый документ не создается.
				ПервоеОтображениеВопроса = Истина;
			КонецЕсли;
			
			ВопросXDTO.ПропущенныйВопрос = Ложь;
			
			// После ответа на вопрос количество показов не считается.
			
			Если НЕ ДокументОтветаНаВопрос.ВопросОтвечен Тогда 
				ДокументОтветаНаВопрос.КоличествоПоказов = ДокументОтветаНаВопрос.КоличествоПоказов + 1; 
				ДокументОтветаНаВопрос.ДатаПоследнегоПоказаВопроса = ТекущаяДата;
			КонецЕсли;
			
			// Определяем, является ли вопрос заблокированным.
			
			ЗаблокированныйВопрос = Ложь;
			
			Если ДокументСессииЗаполнен(ДокументСессии) Тогда	
				
				ВопросВСессии = ДокументСессии.Вопросы.Найти(Вопрос, "Вопрос");
				// Вопроса может не быть в документе, если его добавили после того,
				// Как было начато прохождение теста.
				Если НЕ ЗначениеЗаполнено(ВопросВСессии) Тогда 
					ЗаблокированныйВопрос = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			
			Если ДокументОтветаНаВопрос.ВопросОтвечен ИЛИ ДокументСессии.ТестЗавершен Тогда
				ЗаблокированныйВопрос = Истина;
			КонецЕсли;
			
			Если ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения) <> ДокументОтветаНаВопрос.Пользователь Тогда
				ЗаблокированныйВопрос = Истина;
			КонецЕсли;
			
			ВопросXDTO.ЗаблокированныйВопрос         = ЗаблокированныйВопрос;
			
			// Определяем вес вопроса
			
			Если ДокументСессииЗаполнен(ДокументСессии) Тогда
				
				ВопросВСессии = ДокументСессии.Вопросы.Найти(Вопрос, "Вопрос");
				
				Если ВопросВСессии = Неопределено Тогда 
					ВопросXDTO.Вес = 1;
				Иначе
					ВопросXDTO.Вес = ВопросВСессии.ВесВопроса;
				КонецЕсли;
				
			Иначе
				
				ВопросXDTO.Вес = 1;
				
			КонецЕсли;
			
			
			// Проверяем изменялся ли вопрос после ответа на него.
			
			ВопросИзменялсяПослеОтвета    = Ложь;
			
			// Используется быстрый, но не точный способ определения даты изменения вопроса - на основе
			// Даты изменения объекта. Но может быть ситуация, когда были изменены подчиненные элементы
			// Без записи самого объекта.
			
			// Если тест не завершен, но вопрос уже отвечен и ответ был дан до изменений.
			Если ДокументОтветаНаВопрос.ВопросОтвечен И ДокументОтветаНаВопрос.ДатаПоследнегоПоказаВопроса < Вопрос.ДатаИзменения Тогда
				ВопросИзменялсяПослеОтвета = Истина;
			КонецЕсли;
			
			ВопросXDTO.ВопросИзменялсяПослеОтвета    = ВопросИзменялсяПослеОтвета;
			
			// Определяем можно ли повторить ответ
			
			ВопросXDTO.ВозможноПовторитьОтвет = Документы.ОтветНаВопросСУЗ.ВозможноПовторитьОтветНаВопрос(ДокументСессии, ДокументОтветаНаВопрос);
			
			// Формируем основные реквизиты вопроса объекта ВопросXDTO.
			
			////////////////////////////////////////////////////////////////////////
			МассивПолучаемыхРеквизитов = Новый Массив();
			МассивПолучаемыхРеквизитов.Добавить("ТекстовыеДанные");
			МассивПолучаемыхРеквизитов.Добавить("ФорматированныйДокумент");
			МассивПолучаемыхРеквизитов.Добавить("ВерныйКомментарий");
			МассивПолучаемыхРеквизитов.Добавить("ОшибочныйКомментарий");
			ВыборкаВсехДанныхВопроса = ОбъектыСУЗ.ПолучитьДанные(Вопрос,,Истина,МассивПолучаемыхРеквизитов,ПоставщикСводаЗнаний);
			////////////////////////////////////////////////////////////////////////
			
			ВопросXDTO.ПроверяетсяПреподавателем = ДокументОтветаНаВопрос.ПроверяетсяПреподавателем;
			
			ВопросXDTO.ПроверенПреподавателем = ДокументОтветаНаВопрос.ПроверенПреподавателем;
			
			Если  ДокументОтветаНаВопрос.ВопросОтвечен
				И ДокументОтветаНаВопрос.ПроверяетсяПреподавателем
				И ДокументОтветаНаВопрос.Пользователь <> ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения) Тогда
				ВопросXDTO.ЭтоПроверкаПреподавателем = Истина;
			Иначе
				ВопросXDTO.ЭтоПроверкаПреподавателем = Ложь;
			КонецЕсли;
			
			
			Если ДокументСессииЗаполнен(ДокументСессии) Тогда
				ВопросXDTO.ПереходитьВпередАвтоматически = ДокументСессии.ПереходитьВпередАвтоматически;
			Иначе
				ВопросXDTO.ПереходитьВпередАвтоматически = Ложь;
			КонецЕсли;
			
			// ТекстВопроса
			
			ТекстВопроса = "";
			ВыборкаВсехДанныхВопроса.Сбросить();
			Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Вопрос", "КодДанных") Тогда
				
				Если Вопрос.ИспользуетсяФорматированныйДокумент Тогда
					
					ФорматированныйДокумент = ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить();
					ПредставлениеВопросаФД = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторВопроса, "Вопрос");
					
					Если ПредставлениеВопросаФД.ЕстьВложения Тогда
						ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Вопрос, КонтекстВыполнения.СписокРесурсов, "Вопрос");
					КонецЕсли;
					
					ТекстВопроса = ПредставлениеВопросаФД.ПредставлениеHTML;
					
				Иначе
					
					ТекстВопроса = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;	
					ТекстВопроса = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстВопроса);
					
				КонецЕсли;
				
				ОбъектыСУЗ.ДобавитьРесурсыОбъектаВМассивРесурсов(Вопрос, КонтекстВыполнения.СписокРесурсов, КонтекстВыполнения.СписокПодсказок);			
				
			КонецЕсли;
			
			Если Вопрос.ФасетныйВопрос И КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
				
				Если ПервоеОтображениеВопроса Тогда
					ДокументОтветаНаВопрос.Фасет = ПолучитьСлучайныйФасет(Вопрос);
				КонецЕсли;
				
				ФасетXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Фасет"); 
				ФасетXDTO     = ФабрикаXDTO.Создать(ФасетXDTOТип);
				
				ФасетВопроса = ДокументОтветаНаВопрос.Фасет;
				
				ФасетXDTO.id = ФасетВопроса.УникальныйИдентификатор();
				
				Для каждого ЗначениеФасета Из ФасетВопроса.ЗначенияФасета Цикл
					ТекстВопроса = СтрЗаменить(ТекстВопроса, "{{"+ЗначениеФасета.НомерСтроки+"}}", ЗначениеФасета.ТекстВарианта);
				КонецЦикла;
				
				ВопросXDTO.Фасет = ФасетXDTO;
				
			КонецЕсли;
			
			ВопросXDTO.ТекстВопроса = ТекстВопроса;
			
			// ТекстПодсказки
			
			ПодсказкаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Подсказка"); 
			ПодсказкаXDTO     = ФабрикаXDTO.Создать(ПодсказкаXDTOТип);
			
			ТекстПодсказки = "";
			ВыборкаВсехДанныхВопроса.Сбросить();
			Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Подсказка", "КодДанных") Тогда
				
				Если Вопрос.ИспользуетсяФорматированныйДокумент Тогда
					
					ФорматированныйДокумент = ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить();
					ПредставлениеПодсказкиФД = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторВопроса, "Подсказка");
					
					Если ПредставлениеПодсказкиФД.ЕстьВложения Тогда
						ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Вопрос, КонтекстВыполнения.СписокРесурсов, "Подсказка");
					КонецЕсли;
					
					ТекстПодсказки = ПредставлениеПодсказкиФД.ПредставлениеHTML;
					
				Иначе
					
					ТекстПодсказки = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;	
					ТекстПодсказки = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстПодсказки);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДокументОтветаНаВопрос.ИспользованаПодсказка Тогда
				
				ПодсказкаXDTO.ТекстПодсказки = ТекстПодсказки;
				ПодсказкаXDTO.ДоступнаПодсказка = Ложь;
				
			Иначе
				
				Если ЗначениеЗаполнено(СокрЛП(ОбщегоНазначенияСУ.ВыделитьТекстHTMLДокумента(ТекстПодсказки))) И НЕ ЗаблокированныйВопрос Тогда
					
					ПодсказкаXDTO.ДоступнаПодсказка = Истина;
					
					Если ДокументСессии <> Неопределено И ДанныеПодборки <> Неопределено И ДанныеПодборки.ПоказыватьСтоимостьВопроса Тогда
						
						СтоимостьВопросаВТесте = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СтоимостьВопроса(Вопрос, ДокументСессии.Вопросы);
						ПодсказкаXDTO.ШтрафЗаПодсказку = Окр(СтоимостьВопросаВТесте * (Вопрос.ШтрафЗаПодсказку / 100), 2);
						
					Иначе
						
						ПодсказкаXDTO.ШтрафЗаПодсказку = Вопрос.ШтрафЗаПодсказку;
						
					КонецЕсли;
					
				Иначе
					
					ПодсказкаXDTO.ДоступнаПодсказка = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ВопросXDTO.Подсказка = ПодсказкаXDTO;
			
			// Другое
			
			ВопросXDTO.Результат = ДокументОтветаНаВопрос.Результат;
			
			Если ДокументОтветаНаВопрос.ИспользованаПодсказка Тогда
				ВопросXDTO.РезультатБезШтрафа = ВопросXDTO.Результат + Вопрос.ШтрафЗаПодсказку; 
			Иначе
				ВопросXDTO.РезультатБезШтрафа = ВопросXDTO.Результат;
			КонецЕсли;
			
			Если ВопросXDTO.РезультатБезШтрафа > 100 Тогда
				ВопросXDTO.РезультатБезШтрафа = 100;
			КонецЕсли;
			
			Если ДокументСессииЗаполнен(ДокументСессии) Тогда
				
				ВопросXDTO.ПоказыватьСтоимостьВопроса = ДанныеПодборки.ПоказыватьСтоимостьВопроса;
				
				ВопросXDTO.СтоимостьВопросаВТесте = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СтоимостьВопроса(Вопрос, ДокументСессии.Вопросы);
				
				Если ДокументОтветаНаВопрос.ВопросОтвечен Тогда
					ВопросXDTO.НабраноБалловВТесте = Окр(ВопросXDTO.СтоимостьВопросаВТесте*(ВопросXDTO.Результат / 100), 2);
				Иначе
					ВопросXDTO.НабраноБалловВТесте = 0;
				КонецЕсли;
				
			Иначе
				
				ВопросXDTO.ПоказыватьСтоимостьВопроса = Ложь;
				
			КонецЕсли;
			
			
			ВопросXDTO.ВопросОтвечен = ДокументОтветаНаВопрос.ВопросОтвечен;
			
			Если ВопросXDTO.РазрешенРазвернутыйОтвет Тогда
				ВопросXDTO.РазвернутыйОтветПользователя = ДокументОтветаНаВопрос.РазвернутыйОтветПользователя;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Вопрос.ЭлементActiveX) Тогда
				
				СтруктураДанныхActiveX = ОбъектыСУЗ.ПолучитьПредставление(Вопрос.ЭлементActiveX, ПараметрыСсылки, КонтекстВыполнения);
				
				ActiveXТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources","ОбъектСУЗ");
				ActiveXXDTO = ФабрикаXDTO.Создать(ActiveXТип);
				
				ActiveXXDTO.id            = Вопрос.ЭлементActiveX.УникальныйИдентификатор();
				ActiveXXDTO.object        = ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(Вопрос.ЭлементActiveX); 
				ActiveXXDTO.Представление = СтруктураДанныхActiveX.Представление;
				ActiveXXDTO.Скрипт        = СтруктураДанныхActiveX.Скрипт;
				
				ВопросXDTO.ЭлементActiveX = ActiveXXDTO;
				
			КонецЕсли;
			
			// Формируем варианты ответов
			
			Если ИмяТипаВопроса <> "Открытый"
				И ИмяТипаВопроса <> "ЭлементActiveX" Тогда // Для этих типов нет вариантов ответов
				
				// Формируем таблицу вариантов ответов, категорий и групп вариантов ответов.
				
				// А. Получаем из базы данных выборку вариантов ответов на вопрос из подчиненного справочника "ВариантыОтветовНаВопросСУЗ"
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВариантыОтветовНаВопросСУЗ.Ссылка,
				|	ВариантыОтветовНаВопросСУЗ.Родитель,
				|	ВариантыОтветовНаВопросСУЗ.ЭтоГруппа,
				|	ВариантыОтветовНаВопросСУЗ.Код,
				|	ВариантыОтветовНаВопросСУЗ.Наименование,
				|	ВариантыОтветовНаВопросСУЗ.Ресурс,
				|	ВариантыОтветовНаВопросСУЗ.ВернаяГруппаФасетов,
				|	ВариантыОтветовНаВопросСУЗ.Верный,
				|	ВариантыОтветовНаВопросСУЗ.КоличествоДоступныхВариантов,
				|	ВариантыОтветовНаВопросСУЗ.Категория,
				|	ВариантыОтветовНаВопросСУЗ.ПредлагатьВыборВариантов,
				|	ВариантыОтветовНаВопросСУЗ.Категория.Наименование КАК НаименованиеКатегории,
				|	ВариантыОтветовНаВопросСУЗ.ДатаИзменения,
				|	ВариантыОтветовНаВопросСУЗ.РесурсДляВерногоКомментария,
				|	ВариантыОтветовНаВопросСУЗ.РесурсДляОшибочногоКомментария,
				|	ВариантыОтветовНаВопросСУЗ.Родитель.Код КАК КодГруппы
				|ИЗ
				|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
				|ГДЕ
				|	ВариантыОтветовНаВопросСУЗ.Владелец = &Вопрос
				|	И ВариантыОтветовНаВопросСУЗ.ПометкаУдаления = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВариантыОтветовНаВопросСУЗ.Ссылка ИЕРАРХИЯ");			
				
				Запрос.УстановитьПараметр("Вопрос", Вопрос);
				
				ВыборкаВариантовОтветов = Запрос.Выполнить().Выбрать();
				
				// Б. Формируем табличные части "ВариантыОтветов", "ГруппыВариантовОтветов"
				// И "КатегорииВариантовОтветов" документа "ОтветНаВопросСУЗ".
				
				Если ПервоеОтображениеВопроса Тогда
					
					// Примечание: Табличная часть ВариантыОтветов может быть не заполнена
					// После нажатия на кнопку "Повторить ответ", когда все данные о предыдущем
					// Ответе стираются.
					
					// Формируем промежуточные таблицы для хранения данных о вариантах ответов
					// И групп вариантов ответов.
					
					ТипВариант           = Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовНаВопросСУЗ");
					ТипЧисло             = Новый ОписаниеТипов("Число");
					ТипБулево            = Новый ОписаниеТипов("Булево");
					ТипКатегорияВарианта = Новый ОписаниеТипов("СправочникСсылка.КатегорииВариантовОтветовНаВопросСУЗ");
					
					// Варианты ответов
					ТаблицаВариантовОтветов = Новый ТаблицаЗначений;
					ТаблицаВариантовОтветов.Колонки.Добавить("Ссылка", ТипВариант);
					ТаблицаВариантовОтветов.Колонки.Добавить("НомерВарианта", ТипЧисло);
					ТаблицаВариантовОтветов.Колонки.Добавить("Группа", ТипВариант);
					ТаблицаВариантовОтветов.Колонки.Добавить("Категория", ТипКатегорияВарианта);
					ТаблицаВариантовОтветов.Колонки.Добавить("ПозицияВарианта", ТипЧисло);
					ТаблицаВариантовОтветов.Колонки.Добавить("Код", ТипЧисло);
					ТаблицаВариантовОтветов.Колонки.Добавить("Порядок", ТипЧисло);
					
					// Группы вариантов
					ТаблицаГруппВариантовОтветов = Новый ТаблицаЗначений;
					ТаблицаГруппВариантовОтветов.Колонки.Добавить("Ссылка", ТипВариант);
					ТаблицаГруппВариантовОтветов.Колонки.Добавить("Код", ТипЧисло);
					ТаблицаГруппВариантовОтветов.Колонки.Добавить("НомерГруппы", ТипЧисло);
					ТаблицаГруппВариантовОтветов.Колонки.Добавить("ДопустимоеКоличествоЭлементовВГруппе", ТипЧисло);
					ТаблицаГруппВариантовОтветов.Колонки.Добавить("КоличествоЭлементовВГруппе", ТипЧисло);
					
					// Категории вариантов
					
					ТаблицаКатегорийВариантовОтветов = Новый ТаблицаЗначений;
					ТаблицаКатегорийВариантовОтветов.Колонки.Добавить("Ссылка", ТипКатегорияВарианта);
					
					ТекГруппа = Справочники.ВариантыОтветовНаВопросСУЗ.ПустаяСсылка();
					
					Пока ВыборкаВариантовОтветов.Следующий() Цикл // Формируем таблицы
						
						Если ВыборкаВариантовОтветов.ЭтоГруппа Тогда
							
							НоваяГруппа = ТаблицаГруппВариантовОтветов.Добавить();
							
							НоваяГруппа.Ссылка = ВыборкаВариантовОтветов.Ссылка;
							НоваяГруппа.Код    = ВыборкаВариантовОтветов.Код;
							
							// Вариант может принадлежать группе, тогда запоминаем для него его группу
							// И количество доступных в группе вариантов для последующего удаления лишних.
							Если ПервоеОтображениеВопроса Тогда
								
								Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
									НоваяГруппа.ДопустимоеКоличествоЭлементовВГруппе = ВыборкаВариантовОтветов.КоличествоДоступныхВариантов;
								Иначе
									НоваяГруппа.ДопустимоеКоличествоЭлементовВГруппе = 0;
								КонецЕсли;
								
								НоваяГруппа.КоличествоЭлементовВГруппе = 0;
								
							КонецЕсли;
							
							ТекГруппа = ВыборкаВариантовОтветов.Ссылка;
							
						Иначе
							
							НовыйВариант = ТаблицаВариантовОтветов.Добавить();
							
							Если НЕ ЗначениеЗаполнено(ВыборкаВариантовОтветов.Родитель) Тогда
								ТекГруппа = Справочники.ВариантыОтветовНаВопросСУЗ.ПустаяСсылка();	
							КонецЕсли;
							
							Если ПервоеОтображениеВопроса И ЗначениеЗаполнено(ТекГруппа) Тогда
								НоваяГруппа.КоличествоЭлементовВГруппе = НоваяГруппа.КоличествоЭлементовВГруппе + 1;
							КонецЕсли;
							
							НовыйВариант.Группа      = ТекГруппа;
							НовыйВариант.Ссылка      = ВыборкаВариантовОтветов.Ссылка;
							НовыйВариант.Категория   = ВыборкаВариантовОтветов.Категория;
							НовыйВариант.Код         = ВыборкаВариантовОтветов.Код;
							НовыйВариант.Порядок     = ?(ЗначениеЗаполнено(ВыборкаВариантовОтветов.Родитель), Число(Строка(ВыборкаВариантовОтветов.КодГруппы) + Строка(ВыборкаВариантовОтветов.Код)), Число(Строка(ВыборкаВариантовОтветов.Код) + Строка(ВыборкаВариантовОтветов.Код)));
							
						КонецЕсли;
						
					КонецЦикла;
					
					
					// Удаляем лишние варианты ответов из таблицы ТаблицаВариантовОтветов
					Для каждого ГруппаСтрока Из ТаблицаГруппВариантовОтветов Цикл
						
						Если ГруппаСтрока.ДопустимоеКоличествоЭлементовВГруппе > 0
							И ГруппаСтрока.КоличествоЭлементовВГруппе > ГруппаСтрока.ДопустимоеКоличествоЭлементовВГруппе Тогда
							
							Отбор = Новый Структура();
							Отбор.Вставить("Группа", ГруппаСтрока.Ссылка);
							
							МассивСтрокГруппы = ТаблицаВариантовОтветов.НайтиСтроки(Отбор);
							МассивСтрокГруппы = ОбщегоНазначенияСУ.ПеремешатьМассив(МассивСтрокГруппы);
							
							Сч = ГруппаСтрока.КоличествоЭлементовВГруппе;
							ДопустимоеКоличествоЭлементов = ГруппаСтрока.ДопустимоеКоличествоЭлементовВГруппе;
							
							Пока Сч > ДопустимоеКоличествоЭлементов Цикл
								
								УдаляемаяСтрока = МассивСтрокГруппы[Сч-1];
								ТаблицаВариантовОтветов.Удалить(УдаляемаяСтрока);
								МассивСтрокГруппы.Удалить(Сч-1);
								
								Сч = Сч - 1;
								
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЦикла;
					
					ТаблицаВариантовОтветов.Сортировать("Порядок");
					
					// Формируем табличные части "ВариантыОтветов", "ГруппыВариантовОтветов"
					// И "КатегорииВариантовОтветов" документа "ОтветНаВопросСУЗ".
					
					
					КоличествоВариантов = ТаблицаВариантовОтветов.Количество();
					ИндексМассив = ОбщегоНазначенияСУ.ИндексМассив(0, КоличествоВариантов, ?(КонтекстВыполнения.ПараметрыЭкспорта = Неопределено, Вопрос.ПеремешиватьВарианты, Ложь));
					
					Для Сч=0 По КоличествоВариантов-1 Цикл
						
						// Табличная часть "ВариантыОтветов"
						
						ВариантИзТаблицы = ТаблицаВариантовОтветов.Получить(ИндексМассив[Сч]);
						ВариантТЧДокумента = ДокументОтветаНаВопрос.ВариантыОтветов.Добавить();
						ВариантТЧДокумента.ВариантОтвета = ВариантИзТаблицы.Ссылка;
						ВариантТЧДокумента.НомерВарианта = Сч + 1;
						ВариантТЧДокумента.ПозицияВарианта = Сч + 1; // При первом отображении вопроса на соответствие позиция равна номеру вопроса.
						
						// Таблица "ТаблицаКатегорийВариантовОтветов"
						// Категории попадают только те, что есть у вариантов!
						
						Если ЗначениеЗаполнено(ВариантИзТаблицы.Категория)
							И ТаблицаКатегорийВариантовОтветов.Найти(ВариантИзТаблицы.Категория, "Ссылка") = Неопределено Тогда
							
							НоваяКатегорияСтрока = ТаблицаКатегорийВариантовОтветов.Добавить();
							НоваяКатегорияСтрока.Ссылка = ВариантИзТаблицы.Категория;
							
						КонецЕсли;
						
					КонецЦикла;
					
					// Табличная часть "ГруппыВариантовОтветов"
					// Попадают все группы!
					
					ТаблицаГруппВариантовОтветов.Сортировать("Код");
					
					КоличествоГруппВариантов = ТаблицаГруппВариантовОтветов.Количество();
					
					Для Сч=0 По КоличествоГруппВариантов-1 Цикл
						ГруппаИзТаблицы = ТаблицаГруппВариантовОтветов.Получить(Сч);
						ГруппаТЧДокумента = ДокументОтветаНаВопрос.ГруппыВариантовОтветов.Добавить();
						ГруппаТЧДокумента.Группа = ГруппаИзТаблицы.Ссылка;
						ГруппаТЧДокумента.НомерГруппы = Сч + 1;
					КонецЦикла;
					
					// Табличная часть "КатегорииВариантовОтветов"
					// Категории попадают только те, что есть у вариантов!
					
					ТаблицаКатегорийВариантовОтветов.Сортировать("Ссылка");
					
					КоличествоКатегорийВариантов = ТаблицаКатегорийВариантовОтветов.Количество();
					
					Для Сч=0 По КоличествоКатегорийВариантов-1 Цикл
						КатегорияИзТаблицы = ТаблицаКатегорийВариантовОтветов.Получить(Сч);
						КатегорияТЧДокумента = ДокументОтветаНаВопрос.КатегорииВариантовОтветов.Добавить();
						КатегорияТЧДокумента.Категория = КатегорияИзТаблицы.Ссылка;
						КатегорияТЧДокумента.НомерКатегории = Сч + 1;
					КонецЦикла;
					
				КонецЕсли;
				
				// В. Формируем XDTO вариантов ответов.
				
				// Варианты ответов.
				
				ВариантыОтветовТип =  ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ВариантыОтветов"); 
				ВариантыОтветовXDTO = ФабрикаXDTO.Создать(ВариантыОтветовТип);
				
				ВариантОтветаТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ВариантОтвета"); 
				
				Для каждого ЭлементТЧ Из ДокументОтветаНаВопрос.ВариантыОтветов Цикл
					
					ВыборкаВсехДанныхВопроса.Сбросить();
					ВыборкаВариантовОтветов.Сбросить();
					
					Если ВыборкаВариантовОтветов.НайтиСледующий(ЭлементТЧ.ВариантОтвета, "Ссылка")
						И ВыборкаВсехДанныхВопроса.НайтиСледующий(ЭлементТЧ.ВариантОтвета, "КодДанных") Тогда
						
						ВариантОтветаXDTO = ФабрикаXDTO.Создать(ВариантОтветаТип);
						ВариантОтветаXDTO.Номер           = ЭлементТЧ.НомерВарианта;
						ВариантОтветаXDTO.Выбран          = ЭлементТЧ.Выбран;
						ВариантОтветаXDTO.ПозицияВарианта = ЭлементТЧ.ПозицияВарианта;
						ВариантОтветаXDTO.Текст           = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;
						ВариантОтветаXDTO.Код             = ВыборкаВариантовОтветов.Код;
						ВариантОтветаXDTO.Идентификатор   = Строка(ВыборкаВариантовОтветов.Ссылка.УникальныйИдентификатор());
						ВариантОтветаXDTO.Наименование    = ВыборкаВариантовОтветов.Наименование;
						
						// Находим номера групп и категорий с которыми был соотнесен вариант пользователем.
						Если ЗначениеЗаполнено(ЭлементТЧ.ВыбраннаяГруппа) Тогда
							ГруппаТЧДокумента = ДокументОтветаНаВопрос.ГруппыВариантовОтветов.Найти(ЭлементТЧ.ВыбраннаяГруппа, "Группа");
							Если ГруппаТЧДокумента <> Неопределено Тогда
								ВариантОтветаXDTO.НомерВыбраннойГруппы = ГруппаТЧДокумента.НомерГруппы; 
							КонецЕсли;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ЭлементТЧ.ВыбраннаяКатегория) Тогда
							КатегорияТЧДокумента = ДокументОтветаНаВопрос.КатегорииВариантовОтветов.Найти(ЭлементТЧ.ВыбраннаяКатегория, "Категория");
							Если КатегорияТЧДокумента <> Неопределено Тогда
								ВариантОтветаXDTO.НомерВыбраннойКатегории = КатегорияТЧДокумента.НомерКатегории;
							КонецЕсли;
						КонецЕсли;
						
						ГруппаВарианта = ДокументОтветаНаВопрос.ГруппыВариантовОтветов.Найти(ВыборкаВариантовОтветов.Родитель, "Группа");
						
						Если ГруппаВарианта <> Неопределено Тогда
							ВариантОтветаXDTO.НомерГруппы = ГруппаВарианта.НомерГруппы;		 
						КонецЕсли;
						
						//3. Размещаем ресурс варианта, если он выбран.
						Если ЗначениеЗаполнено(ВыборкаВариантовОтветов.Ресурс) Тогда
							
							СтруктураРесурса = ОбъектыСУЗ.ПолучитьПредставление(ВыборкаВариантовОтветов.Ресурс, ПараметрыСсылки, КонтекстВыполнения);
							
							ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
							РесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
							РесурсXDTO.Представление = СтруктураРесурса.Представление;
							РесурсXDTO.Скрипт = СтруктураРесурса.Скрипт;
							
							ВариантОтветаXDTO.Ресурс = РесурсXDTO;
							
						КонецЕсли;
						
						ВариантыОтветовXDTO.ВариантОтвета.Добавить(ВариантОтветаXDTO);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВопросXDTO.ВариантыОтветов = ВариантыОтветовXDTO;
				
				// Группы вариантов ответов.
				
				ГруппыВариантовОтветовТип =  ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ГруппыВариантовОтветов"); 
				ГруппыВариантовОтветовXDTO = ФабрикаXDTO.Создать(ГруппыВариантовОтветовТип);
				
				ГруппаВариантаОтветаТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ГруппаВариантаОтвета"); 
				
				Для каждого ЭлементТЧ Из ДокументОтветаНаВопрос.ГруппыВариантовОтветов Цикл
					
					ВыборкаВсехДанныхВопроса.Сбросить();
					ВыборкаВариантовОтветов.Сбросить();
					
					Если ВыборкаВсехДанныхВопроса.НайтиСледующий(ЭлементТЧ.Группа, "КодДанных")
						И ВыборкаВариантовОтветов.НайтиСледующий(ЭлементТЧ.Группа, "Ссылка") Тогда
						
						ГруппаВариантаОтветаXDTO = ФабрикаXDTO.Создать(ГруппаВариантаОтветаТип);
						ГруппаВариантаОтветаXDTO.Номер = ЭлементТЧ.НомерГруппы;
						ГруппаВариантаОтветаXDTO.Наименование = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;
						ГруппаВариантаОтветаXDTO.Идентификатор = Строка(ВыборкаВариантовОтветов.Ссылка.УникальныйИдентификатор());
						ГруппаВариантаОтветаXDTO.ПредлагатьВыборВариантов = ВыборкаВариантовОтветов.ПредлагатьВыборВариантов;
						
					КонецЕсли;
					
					Если ГруппаВариантаОтветаXDTO <> Неопределено Тогда
						ГруппыВариантовОтветовXDTO.ГруппаВариантаОтвета.Добавить(ГруппаВариантаОтветаXDTO);
					КонецЕсли;
					
				КонецЦикла;
				
				ВопросXDTO.ГруппыВариантовОтветов = ГруппыВариантовОтветовXDTO;
				
				// Категории вариантов ответов.
				
				КатегорииВариантовОтветовТип =  ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "КатегорииВариантовОтветов"); 
				КатегорииВариантовОтветовXDTO = ФабрикаXDTO.Создать(КатегорииВариантовОтветовТип);
				
				КатегорияВариантаОтветаТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "КатегорияВариантаОтвета"); 
				
				Для каждого ЭлементТЧ Из ДокументОтветаНаВопрос.КатегорииВариантовОтветов Цикл
					
					ВыборкаВариантовОтветов.Сбросить();
					
					Если ВыборкаВариантовОтветов.НайтиСледующий(ЭлементТЧ.Категория, "Категория") Тогда
						
						КатегорияВариантаОтветаXDTO = ФабрикаXDTO.Создать(КатегорияВариантаОтветаТип);
						КатегорияВариантаОтветаXDTO.Номер = ЭлементТЧ.НомерКатегории;
						КатегорияВариантаОтветаXDTO.Наименование = ВыборкаВариантовОтветов.НаименованиеКатегории;
						
						КатегорииВариантовОтветовXDTO.КатегорияВариантаОтвета.Добавить(КатегорияВариантаОтветаXDTO);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВопросXDTO.КатегорииВариантовОтветов = КатегорииВариантовОтветовXDTO;
				
				// Текстовые ответы пользователя для вопроса по шаблону
				
				Если ИмяТипаВопроса = "ПоШаблону" Тогда
					
					ОтветыПоШаблонуТип =  ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ОтветыПоШаблону"); 
					ОтветыПоШаблонуXDTO = ФабрикаXDTO.Создать(ОтветыПоШаблонуТип);
					
					ОтветПоШаблонуТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ОтветПоШаблону"); 
					
					Для каждого ЭлементТЧ Из ДокументОтветаНаВопрос.ОтветыПоШаблону Цикл
						
						ОтветПоШаблонуXDTO = ФабрикаXDTO.Создать(ОтветПоШаблонуТип);
						ОтветПоШаблонуXDTO.ТекстОтвета = ЭлементТЧ.ТекстОтвета;
						
						ГруппаВТЧ = ДокументОтветаНаВопрос.ГруппыВариантовОтветов.Найти(ЭлементТЧ.ГруппаВариантов, "Группа");
						
						Если ГруппаВТЧ <> Неопределено Тогда
							ОтветПоШаблонуXDTO.НомерГруппы = ГруппаВТЧ.НомерГруппы;
						КонецЕсли;
						
						ОтветыПоШаблонуXDTO.Ответ.Добавить(ОтветПоШаблонуXDTO);
						
					КонецЦикла;
					
					ВопросXDTO.ОтветыПоШаблону = ОтветыПоШаблонуXDTO;
					
				КонецЕсли;
				
			КонецЕсли; // Конец: 6.
			
			// Комментарии к ответу пользователя
			
			Если ДокументОтветаНаВопрос.ВопросОтвечен И КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
				
				КомментарииXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Комментарии"); 
				КомментарииXDTO     = ФабрикаXDTO.Создать(КомментарииXDTOТип);
				
				КомментарийXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Комментарий"); 
				
				// Комментарий преподавателя
				
				Если НЕ ПустаяСтрока(ДокументОтветаНаВопрос.КомментарийПреподавателя)
					ИЛИ ВопросXDTO.ЭтоПроверкаПреподавателем Тогда
					
					// Если это проверка преподавателем, то показываем даже пустой комментарий.
					
					КомментарийXDTO = ФабрикаXDTO.Создать(КомментарийXDTOТип);
					КомментарийXDTO.ТекстКомментария = ДокументОтветаНаВопрос.КомментарийПреподавателя;
					КомментарийXDTO.ЭтоКомментарийПреподавателя = Истина;
					КомментарииXDTO.Комментарий.Добавить(КомментарийXDTO);
					
				КонецЕсли;
				
				// Общий комментарий
				
				ОбщийКомментарийНаОтвет = "";
				ВыборкаВсехДанныхВопроса.Сбросить();
				Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Ответ", "КодДанных") Тогда
					
					Если Вопрос.ИспользуетсяФорматированныйДокумент Тогда
						
						ФорматированныйДокумент = ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить();
						ОтветФД = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторВопроса, "Ответ");
						
						Если ОтветФД.ЕстьВложения Тогда
							ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Вопрос, КонтекстВыполнения.СписокРесурсов, "Ответ");
						КонецЕсли;
						
						ОбщийКомментарийНаОтвет = ОтветФД.ПредставлениеHTML;
						
					Иначе
						
						ОбщийКомментарийНаОтвет = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;	
						ОбщийКомментарийНаОтвет = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ОбщийКомментарийНаОтвет);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ОбщийКомментарийНаОтвет) Тогда
					
					КомментарийXDTO = ФабрикаXDTO.Создать(КомментарийXDTOТип);
					КомментарийXDTO.ТекстКомментария = ОбщийКомментарийНаОтвет;
					КомментарийXDTO.ЭтоКомментарийПреподавателя = Ложь;
					КомментарииXDTO.Комментарий.Добавить(КомментарийXDTO);
					
				КонецЕсли;
				
				// Комментарии к вариантам ответов
				
				Для каждого Вариант Из ДокументОтветаНаВопрос.ВариантыОтветов Цикл
					
					Если Вариант.ВерныйВыбран ИЛИ Вариант.ОшибочныйНеВыбран Тогда
						ТипКомментария = "ВерныйКомментарий";
					Иначе
						ТипКомментария = "ОшибочныйКомментарий"
					КонецЕсли;
					
					ВыборкаВсехДанныхВопроса.Сбросить();
					ВыборкаВариантовОтветов.Сбросить();
					
					Если ВыборкаВсехДанныхВопроса.НайтиСледующий(Вариант.ВариантОтвета, "КодДанных")
						И ВыборкаВариантовОтветов.НайтиСледующий(Вариант.ВариантОтвета, "Ссылка") Тогда
						
						КомментарийXDTO = ФабрикаXDTO.Создать(КомментарийXDTOТип);
						
						ТекстКомментария = ВыборкаВсехДанныхВопроса[ТипКомментария];
						РесурсКомментария = Справочники.РесурсыСУЗ.ПустаяСсылка();
						
						Если (ТипКомментария = "ВерныйКомментарий" И ЗначениеЗаполнено(ВыборкаВариантовОтветов.РесурсДляВерногоКомментария))
							ИЛИ (ТипКомментария = "ОшибочныйКомментарий" И ЗначениеЗаполнено(ВыборкаВариантовОтветов.РесурсДляОшибочногоКомментария)) Тогда
							
							Если ТипКомментария = "ВерныйКомментарий" Тогда
								РесурсКомментария = ВыборкаВариантовОтветов.РесурсДляВерногоКомментария;
							Иначе
								РесурсКомментария = ВыборкаВариантовОтветов.РесурсДляОшибочногоКомментария;
							КонецЕсли;
							
						КонецЕсли;
						
						Если НЕ ПустаяСтрока(ТекстКомментария) ИЛИ ЗначениеЗаполнено(РесурсКомментария) Тогда
							
							КомментарийXDTO.НомерВарианта = Вариант.НомерВарианта;
							
							Если НЕ ПустаяСтрока(ТекстКомментария) Тогда
								КомментарийXDTO.ТекстКомментария = ТекстКомментария;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(РесурсКомментария) Тогда
								СтруктураРесурса = ОбъектыСУЗ.ПолучитьПредставление(РесурсКомментария, ПараметрыСсылки, КонтекстВыполнения);
								
								ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
								РесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
								РесурсXDTO.Представление = СтруктураРесурса.Представление;
								РесурсXDTO.Скрипт = СтруктураРесурса.Скрипт;
								
								КомментарийXDTO.Ресурс = РесурсXDTO;
							КонецЕсли;
							
							КомментарийXDTO.ЭтоКомментарийПреподавателя = Ложь;
							
							КомментарииXDTO.Комментарий.Добавить(КомментарийXDTO);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВопросXDTO.Комментарии = КомментарииXDTO;
				
			КонецЕсли;
			
			// Картинки общего комментария для режима экспорта
			
			Если КонтекстВыполнения.ПараметрыЭкспорта <> Неопределено Тогда			
				
				ВыборкаВсехДанныхВопроса.Сбросить();
				Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Ответ", "КодДанных") Тогда
					
					Если Вопрос.ИспользуетсяФорматированныйДокумент Тогда
						
						ФорматированныйДокумент = ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить();
						ОтветФД = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторВопроса, "Ответ");
						
						Если ОтветФД.ЕстьВложения Тогда
							ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Вопрос, КонтекстВыполнения.СписокРесурсов, "Ответ");
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				
			КонецЕсли;		
			
			// Данные работы во внешнем программном продукте
			
			Если Вопрос.ТипВопроса = Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме Тогда
				
				// Заполняем этапы работы в программе и параметры, если это не было сделано ранее
				
				Если Вопрос.ЭтапыРаботыВПрограмме.Количество() > 0 И ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Количество() = 0 Тогда
					
					Для каждого Строка Из Вопрос.ЭтапыРаботыВПрограмме Цикл
						
						Если ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Найти(Строка.Код, "Код") = Неопределено Тогда
							НоваяСтрока = ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Добавить();
							НоваяСтрока.Код = Строка.Код;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если Вопрос.Параметры.Количество() > 0 И ДокументОтветаНаВопрос.Параметры.Количество() = 0 Тогда
					
					Для каждого Строка Из Вопрос.Параметры Цикл
						
						Если Строка.ЗаполняетсяПрограммой И ДокументОтветаНаВопрос.Параметры.Найти(Строка.Код, "Код") = Неопределено Тогда
							НоваяСтрока = ДокументОтветаНаВопрос.Параметры.Добавить();
							НоваяСтрока.Код = Строка.Код;
						КонецЕсли;
						
					КонецЦикла;	
					
				КонецЕсли;
				
				РаботаВПрограммеXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "РаботаВПрограммномПродукте");	
				РаботаВПрограммеXDTO    = ФабрикаXDTO.Создать(РаботаВПрограммеXDTOТип); 
				
				ЭтапРаботыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "ЭтапРаботыВПрограммномПродукте");
				
				// Формируем таблицу параметров
				
				ТаблицаПараметров = ТаблицаПараметровВопроса(Вопрос, ДокументОтветаНаВопрос);
				
				// Удаляем те этапы, которых нет в вопросе
				
				Сч = ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Количество();
				
				Пока Сч > 0 Цикл
					
					Строка = ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Получить(Сч - 1);
					
					СвойстваЭтапа = Вопрос.ЭтапыРаботыВПрограмме.Найти(Строка.Код, "Код");
					
					Если СвойстваЭтапа = Неопределено Тогда
						ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Удалить(Сч - 1);
					КонецЕсли;
					
					Сч = Сч - 1;
					
				КонецЦикла;	
				
				Если ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме.Количество() > 0 Тогда
					
					// Заполняем данные этапов
					
					Для каждого Строка Из ДокументОтветаНаВопрос.ЭтапыРаботыВПрограмме Цикл
						
						СвойстваЭтапа = Вопрос.ЭтапыРаботыВПрограмме.Найти(Строка.Код, "Код");
						
						Если СвойстваЭтапа = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						ЭтапРаботыXDTO = ФабрикаXDTO.Создать(ЭтапРаботыXDTOТип);
						
						ЭтапРаботыXDTO.Номер = Строка.НомерСтроки;
						ЭтапРаботыXDTO.Имя = СвойстваЭтапа.Имя;
						ЭтапРаботыXDTO.Код = Строка.Код;
						ЭтапРаботыXDTO.Тип = ОбщегоНазначения.ИмяЗначенияПеречисления(СвойстваЭтапа.Тип);
						ЭтапРаботыXDTO.Активный = Строка.Активный;
						ЭтапРаботыXDTO.Завершен = Строка.Завершен;
						ЭтапРаботыXDTO.ДатаНачала = Строка.ДатаНачала;
						ЭтапРаботыXDTO.ДатаОкончания = Строка.ДатаОкончания;
						ЭтапРаботыXDTO.ОтветПользователя = Строка(Строка.ОтветПользователя);
						ЭтапРаботыXDTO.Ссылка = Строка.ВебСсылка;
						ЭтапРаботыXDTO.Результат = Строка.Результат;
						
						ЭтапРаботыXDTO.Описание = СвойстваЭтапа.Описание;
						
						Для каждого СтрокаТП Из ТаблицаПараметров Цикл
							ЭтапРаботыXDTO.Описание = СтрЗаменить(ЭтапРаботыXDTO.Описание, "{{" + СтрокаТП.Код + "}}", СтрокаТП.Значение);	
						КонецЦикла;
						
						Если ЗначениеЗаполнено(Строка.КодКомментария) Тогда
							
							КомментарииXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Комментарии"); 
							КомментарииXDTO     = ФабрикаXDTO.Создать(КомментарииXDTOТип);
							
							КомментарийXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Question", "Комментарий"); 
							
							МассивКомментариев = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Строка.КодКомментария, ";");
							
							Для каждого КодКомментария Из МассивКомментариев Цикл
								
								КомментарийСтрокаТЧ = Вопрос.Комментарии.Найти(КодКомментария, "Код");
								
								Если КомментарийСтрокаТЧ = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								КомментарийXDTO = ФабрикаXDTO.Создать(КомментарийXDTOТип);
								КомментарийXDTO.ТекстКомментария = КомментарийСтрокаТЧ.Текст;
								
								Для каждого СтрокаТП Из ТаблицаПараметров Цикл
									КомментарийXDTO.ТекстКомментария = СтрЗаменить(КомментарийXDTO.ТекстКомментария, "{{" + СтрокаТП.Код + "}}", СтрокаТП.Значение);	
								КонецЦикла;
								
								КомментарийXDTO.Выделить = КомментарийСтрокаТЧ.Выделить;
								
								Если ЗначениеЗаполнено(КомментарийСтрокаТЧ.Ресурс) Тогда
									
									СтруктураРесурса = ОбъектыСУЗ.ПолучитьПредставление(КомментарийСтрокаТЧ.Ресурс, ПараметрыСсылки, КонтекстВыполнения);
									
									ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
									РесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
									РесурсXDTO.Представление = СтруктураРесурса.Представление;
									РесурсXDTO.Скрипт = СтруктураРесурса.Скрипт;
									
									КомментарийXDTO.Ресурс = РесурсXDTO;
									
								КонецЕсли;
								
								КомментарииXDTO.Комментарий.Добавить(КомментарийXDTO);
								
							КонецЦикла;
							
							ЭтапРаботыXDTO.КомментарииЭтапа = КомментарииXDTO;
							
						КонецЕсли;
						
						РаботаВПрограммеXDTO.Этап.Добавить(ЭтапРаботыXDTO);
						
					КонецЦикла;
					
					ВопросXDTO.РаботаВПрограммномПродукте = РаботаВПрограммеXDTO;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Сохраняем документ ответа на вопрос
			
			Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
				
				ДокументОтветаНаВопрос.Записать(РежимЗаписиДокумента.Проведение);
				
				СессияXDTO.numAnswerDocument = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ДокументОтветаНаВопрос.Номер);
				
			Иначе
				
				СессияXDTO.numAnswerDocument = "-1";
				
			КонецЕсли;		
			
			ВопросXDTO.Сессия = СессияXDTO;
			
			// Симуляция
			
			Если КонтекстВыполнения.Симуляция Тогда 
				
				Если НЕ ДокументОтветаНаВопрос.ВопросОтвечен Тогда
					
					КонтекстВыполнения.АдресОбъекта = "action=submitQuestion&numDocument="+СессияXDTO.numDocument+"&numGroup="+СессияXDTO.numGroup+"&numAnswerDocument="+СессияXDTO.numAnswerDocument+"&id="+ВопросXDTO.id+"&object=question&ТипВопроса="+ВопросXDTO.ТипВопроса+"&AutoNext=true";
					
					Если ВопросXDTO.ТипВопроса = "ОдинИзМногих"
						ИЛИ ВопросXDTO.ТипВопроса = "МногиеИзМногих" Тогда
						
						НомерСлучайногоОтвета = ОбщегоНазначенияСУ.СлучайноеЧисло(1, ДокументОтветаНаВопрос.ВариантыОтветов.Количество());
						
						КонтекстВыполнения.АдресОбъекта = КонтекстВыполнения.АдресОбъекта + "&variant=" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерСлучайногоОтвета);
						
					КонецЕсли;
					
					Если Вопрос.ФасетныйВопрос Тогда
						КонтекстВыполнения.АдресОбъекта = КонтекстВыполнения.АдресОбъекта + "&facet=" + Строка(ПолучитьСлучайныйФасет(Вопрос).УникальныйИдентификатор());
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ВопросXDTO.ПропущенныйВопрос = Истина;
			
		КонецЕсли; // Пропущенный вопрос
		
		// Применяем шаблон к текстам
		
		Если ЗначениеЗаполнено(Вопрос.ШаблонТекста) Тогда
			
			// Получаем путь к основному ресурсу
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РесурсыОбъектовСУЗ.Ресурс
			|ИЗ
			|	Справочник.РесурсыОбъектовСУЗ КАК РесурсыОбъектовСУЗ
			|ГДЕ
			|	РесурсыОбъектовСУЗ.Владелец = &Вопрос
			|	И РесурсыОбъектовСУЗ.Основной = ИСТИНА";
			
			Запрос.УстановитьПараметр("Вопрос", Вопрос);
			
			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				
				ИмяКаталогаОсновногоРесурса = Справочники.РесурсыСУЗ.ИмяКаталогаРесурса(ВыборкаДетальныеЗаписи.Ресурс);
				
			Иначе
				
				ИмяКаталогаОсновногоРесурса = "";
				
			КонецЕсли;
			
			// Обрабатываем тексты на основе шаблона
			
			ВопросXDTO.ТекстВопроса = ОбъектыСУЗ.ПрименитьШаблонКТексту(ВопросXDTO.ТекстВопроса, Вопрос.ШаблонТекста, ИмяКаталогаОсновногоРесурса); 	
			
			Если ВопросXDTO.Подсказка <> Неопределено
				И ВопросXDTO.Подсказка.ТекстПодсказки <> Неопределено Тогда
				
				ВопросXDTO.Подсказка.ТекстПодсказки = ОбъектыСУЗ.ПрименитьШаблонКТексту(ВопросXDTO.Подсказка.ТекстПодсказки, Вопрос.ШаблонТекста, ИмяКаталогаОсновногоРесурса);
				
			КонецЕсли;
			
			Если ВопросXDTO.Комментарии <> Неопределено Тогда
				Для каждого Комментарий Из ВопросXDTO.Комментарии.Комментарий Цикл
					Комментарий.ТекстКомментария = ОбъектыСУЗ.ПрименитьШаблонКТексту(Комментарий.ТекстКомментария, Вопрос.ШаблонТекста, ИмяКаталогаОсновногоРесурса);
				КонецЦикла;
			КонецЕсли;
			
			Если ВопросXDTO.ВариантыОтветов <> Неопределено Тогда
				Для каждого ВариантОтвета Из ВопросXDTO.ВариантыОтветов.ВариантОтвета Цикл
					ВариантОтвета.Текст = ОбъектыСУЗ.ПрименитьШаблонКТексту(ВариантОтвета.Текст, Вопрос.ШаблонТекста, ИмяКаталогаОсновногоРесурса);
				КонецЦикла;
			КонецЕсли;
			
			
		КонецЕсли;	
		
		// Получаем структуру вопроса в XML
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВопросXDTO);
		XMLДанные = ЗаписьXML.Закрыть();
		
		ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Вопрос);
		ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
		
		// Добавляем ссылки на объекты
		
		ОбъектыСУЗ.ДобавитьСсылкиОбъектаВМассив(Вопрос, КонтекстВыполнения);
		
		// Добавляем вопрос в параметры экспорта
		
		Если КонтекстВыполнения.ПараметрыЭкспорта <> Неопределено Тогда	
			КонтекстВыполнения.ПараметрыЭкспорта.Вопросы.Добавить(Вопрос);
		КонецЕсли;
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
	
	Возврат XMLДанные;
	
КонецФункции
	
Функция ПолучитьСлучайныйФасет(Вопрос) Экспорт
	
	Запрос = Новый Запрос;
				
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ФасетыВопросовСУЗ.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ФасетыВопросовСУЗ КАК ФасетыВопросовСУЗ
	|ГДЕ
	|	ФасетыВопросовСУЗ.Владелец = &Владелец И
	|   (НЕ ФасетыВопросовСУЗ.ЭтоГруппа)
	|";
				
	Запрос.УстановитьПараметр("Владелец", Вопрос);
				
	ТаблицаЗапроса    = Запрос.Выполнить().Выгрузить();
	КоличествоФасетов = ТаблицаЗапроса[0].Количество;
	СлучайноеЧисло    = ОбщегоНазначенияСУ.СлучайноеЧисло(1, КоличествоФасетов);
				
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ "+ СлучайноеЧисло +"
	|		ФасетыВопросовСУЗ.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.ФасетыВопросовСУЗ КАК ФасетыВопросовСУЗ
	|	ГДЕ
	|       ФасетыВопросовСУЗ.Владелец = &Владелец И
	|		(НЕ ФасетыВопросовСУЗ.ЭтоГруппа)
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Ссылка) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|";
				
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат Справочники.ФасетыВопросовСУЗ.ПустаяСсылка();
	Иначе
		СлучайныйФасет = ТаблицаЗапроса[0].Ссылка;
	КонецЕсли;
	
	Возврат СлучайныйФасет;
	
КонецФункции

Функция РазрешенРазвернутыйОтветНаВопрос(Вопрос, ДанныеПодборки) Экспорт
	
	Если ДанныеПодборки = Неопределено Тогда
		Возврат Вопрос.РазрешенРазвернутыйОтвет;
	КонецЕсли;
	
	ИсключитьОткрытыеВопросы = ДанныеПодборки.ИсключитьОткрытыеВопросы;
	
	// Обращаемся к свойствам вопроса через точку,
	// Так как данные объектов уже скорее всего закэшированы
	
	Возврат ?(ИсключитьОткрытыеВопросы, Ложь, Вопрос.РазрешенРазвернутыйОтвет);
	
КонецФункции

Функция ДокументСессииЗаполнен(ДокументСессии)
	
	Возврат ?(ДокументСессии = Неопределено ИЛИ ДокументСессии = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ПустаяСсылка(), Ложь, Истина);
	
КонецФункции

Функция ТаблицаПараметровВопроса(Вопрос, ДокументОтветаНаВопрос) Экспорт
	
	// Формируем таблицу параметров

	ТаблицаПараметров = Вопрос.Параметры.Выгрузить();

	Для каждого Строка Из ТаблицаПараметров Цикл
		
		Если НЕ Строка.ЗаполняетсяПрограммой Тогда
			Продолжить;
		КонецЕсли;
			
		НайденнаяСтрока = ДокументОтветаНаВопрос.Параметры.Найти(Строка.Код, "Код");
		
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(НайденнаяСтрока.Значение) = Тип("Булево") Тогда
			Строка.Значение = ОбщегоНазначенияСУКлиентСервер.БулевоВСтроку(НайденнаяСтрока.Значение);
		ИначеЕсли ТипЗнч(НайденнаяСтрока.Значение) = Тип("Дата") Тогда
			Строка.Значение = Формат(НайденнаяСтрока.Значение, "ДЛФ=D; ДП=-");
		Иначе
			Строка.Значение = Строка(НайденнаяСтрока.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПараметров;
	
КонецФункции

Функция ТекстЗаданияВопроса(Вопрос, ИспользуетсяФорматированныйДокумент=Неопределено) Экспорт
	
	Если ИспользуетсяФорматированныйДокумент = Неопределено Тогда
		ИспользуетсяФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вопрос, "ИспользуетсяФорматированныйДокумент");
	КонецЕсли;
	
	ДанныеВопроса = ОбъектыСУЗ.ПолучитьДанные(Вопрос, "Вопрос", Истина, ?(ИспользуетсяФорматированныйДокумент, "ФорматированныйДокумент", "ТекстовыеДанные"));
	
	Возврат ОбъектыСУЗ.ПолучитьТекстовоеПредставлениеДанных(ДанныеВопроса);
	
КонецФункции

Функция ЕстьВерныйВариант(Вопрос) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВариантыОтветовНаВопросСУЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
		|ГДЕ
		|	ВариантыОтветовНаВопросСУЗ.Владелец = &Вопрос
		|	И ВариантыОтветовНаВопросСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыОтветовНаВопросСУЗ.Верный = ИСТИНА";
	
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
		
КонецФункции
	
#КонецЕсли
